Public Attributes | List of all members
API_AnalyticalSurfaceLoadType Struct Reference
Analytical Model
Describes a Structural Analytical Model Member Surface Load. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_AnalyticalSurfaceLoad_Settings  | analyticalSurfaceLoadSettings
 API_AnalyticalMemberPartRef  | loadedMemberPartRef
The Analytical Member part reference where the Analytical Surface Load is applied.
Detailed Description
Describes a Structural Analytical Model Member Surface Load.
Since
Archicad 25
Remarks
An Surface Load element can be created with the aid of ACAPI_Element_Create and it can be removed via the ACAPI_Element_Delete function. Currently the ACAPI_Element_Change function is unavailable for Analytical Surface Loads.